#Даны три целых числа. Найти количество положительных чиселв в исходном наборе.
a = input('Введите целое число a: '),
while type(a) != int: # обработка исключений
    try:
        a = int(a)
    except ValueError:
        print('Неправильно ввели!')
        a = input('Введите целое число a: ')
b = input('Введите целое число b: '),
while type(b) != int: # обработка исключений
    try:
        b = int(b)
    except ValueError:
        print('Неправильно ввели!')
        b = input('Введите целое число b: ')
c = input('Введите целое число c: '),
while type(c) != int: # обработка исключений
    try:
        c = int(c)
    except ValueError:
        print('Неправильно ввели!')
        c = input('Введите целое число c: ')
if a > 0 or b > 0 or c > 0:
    print('вАУ окозалос одно из чисел a, b, c, положительное')
else:
    print('круто парни мы в дерьме ни одно из чисел a, b, c не является положительным')
